# RelinquishedItems Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RelinquishedItems Class
Members See Also
---
List of elements and worksets that were relinquished by the current user.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class RelinquishedItems : IDisposable
```

Visual Basic
---
```text
Public Class RelinquishedItems _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RelinquishedItems : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RelinquishedItems
# See Also
RelinquishedItems Members
Autodesk.Revit.DB Namespace